\c hydaelyn yagi2

DROP TABLE IF EXISTS job;

CREATE TABLE job
(
    id SERIAL PRIMARY KEY,
    name VARCHAR(64),
    type INT
);

ALTER TABLE job
    OWNER TO yagi2;

-- type is jobtype id
INSERT INTO job(id, name, type)
    VALUES
        (1, '斧術士', 1),
        (2, '戦士', 2),
        (3, '剣術士', 1),
        (4, 'ナイト', 2),
        (5, '格闘士', 1),
        (6, 'モンク', 2),
        (7, '槍術士', 1),
        (8, '竜騎士', 2),
        (9, '弓術士', 1),
        (10, '吟遊詩人', 2),
        (11, '呪術士', 1),
        (12, '黒魔道士', 2),
        (13, '幻術士', 1),
        (14, '白魔道士', 2),
        (15, '巴術士', 1),
        (16, '召喚士', 2),
        (17, '学者', 2),
        (18, '双剣士', 1),
        (19, '忍者', 2),
        (20, '暗黒騎士', 2),
        (21, '機工士', 2),
        (22, '占星術師', 2),
        (23, '侍', 2),
        (24, '赤魔道士', 2),
        (25, '鍛冶師', 3),
        (26, '甲冑師', 3),
        (27, '彫金師', 3),
        (28, '裁縫師', 3),
        (29, '錬金術師', 3),
        (30, '革細工師', 3),
        (31, '木工師', 3),
        (32, '調理師', 3),
        (33, '採掘師', 4),
        (34, '園芸師', 4),
        (35, '漁師', 4);


